4 Course/Сервис-ориентированная архитектура/Lab4/backend/routes/getRouteRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getRouteRequest>
            <soap:id>15</soap:id>
        </soap:getRouteRequest>
    </soapenv:Body>
</soapenv:Envelope>